
<!DOCTYPE HTML>
<html lang="en-us" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>统计 · airdb</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-toggle-chapters/toggle.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-tags/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-multipart/multipart.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../" />
    
    
    <link rel="prev" href="matrices-and-vectors.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://airdb.wiki" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">机器学习 - Go</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../../">
            
                <a href="../../../">
            
                    
                    Machine Learning With Go
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../table-of-contents.html">
            
                <a href="../table-of-contents.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../preface.html">
            
                <a href="../preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 01 - 收集和整理数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="./">
            
                <a href="./">
            
                    
                    Chapter 02 - 矩阵，概率和统计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.4.1" data-path="matrices-and-vectors.html">
            
                <a href="matrices-and-vectors.html">
            
                    
                    矩阵和向量
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.1.4.2" data-path="statistics.html">
            
                <a href="statistics.html">
            
                    
                    统计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 03 - 评估与验证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.6" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 04 - 回归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.7" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 05 - 分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.8" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 06 - 聚类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.9" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 07 - 时间序列和异常检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.10" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 08 - 神经网络与深度学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.11" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 09 - 部署和分发分析和模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.12" data-path="../">
            
                <a href="../">
            
                    
                    Chapter 10 - 机器学习相关的算法/技术
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../formula.html">
            
                <a href="../../formula.html">
            
                    
                    Markdown 公式
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Tags</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../../../tags.html">
            
                <a href="../../../tags.html">
            
                    
                    tags
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../../.." >统计</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7EDF;&#x8BA1;"><a name="&#x7EDF;&#x8BA1;" class="plugin-anchor" href="#&#x7EDF;&#x8BA1;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7EDF;&#x8BA1;</h1>
<p>&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6210;&#x529F;&#x5C06;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x53CA;&#x5BF9;&#x7ED3;&#x679C;&#x7684;&#x8BC4;&#x4F30;/&#x9A8C;&#x8BC1;&#x3002; &#x6240;&#x6709;&#x8FD9;&#x4E09;&#x4EF6;&#x4E8B;&#x90FD;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5BF9;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x7EDF;&#x8BA1;&#x9886;&#x57DF;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x91CF;&#x5316;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x548C;&#x7ED3;&#x679C;&#x3002; &#x5B83;&#x8FD8;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x8861;&#x91CF;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x5982;&#x4F55;&#xFF0C;&#x5E76;&#x9632;&#x6B62;&#x67D0;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9677;&#x9631;&#xFF08;&#x4F8B;&#x5982;&#x8FC7;&#x62DF;&#x5408;&#xFF09;&#x3002;</p>
<p>&#x4E0E;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5728;&#x6B64;&#x5904;&#x5BF9;&#x7EDF;&#x8BA1;&#x8FDB;&#x884C;&#x5B8C;&#x6574;&#x4ECB;&#x7ECD;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7EBF;&#x548C;&#x5370;&#x5237;&#x7248;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x8D44;&#x6E90;&#x53EF;&#x4F9B;&#x5B66;&#x4E60;&#x5165;&#x95E8;&#x7EDF;&#x8BA1;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7740;&#x91CD;&#x4E8E;&#x5BF9;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x57FA;&#x672C;&#x7406;&#x89E3;&#x4EE5;&#x53CA;&#x5728;Linux&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5B9E;&#x7528;&#x6027;&#x3002; &#x8D70;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5206;&#x5E03;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x8FD9;&#x4E9B;&#x5206;&#x5E03;&#x8FDB;&#x884C;&#x91CF;&#x5316;&#x548C;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="&#x5206;&#x5E03;"><a name="&#x5206;&#x5E03;" class="plugin-anchor" href="#&#x5206;&#x5E03;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5206;&#x5E03;</h2>
<p>&#x5206;&#x5E03;&#x8868;&#x793A;&#x503C;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x6B63;&#x5728;&#x8DDF;&#x8E2A;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x67D0;&#x9879;&#x4EA7;&#x54C1;&#x6216;&#x670D;&#x52A1;&#x7684;&#x6BCF;&#x65E5;&#x9500;&#x552E;&#x989D;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x6709;&#x4E00;&#x957F;&#x4E32;&#xFF08;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x77E2;&#x91CF;&#x6216;&#x77E9;&#x9635;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF09;&#x6E05;&#x5355;&#x6570;&#x5B57;&#x3002;&#x8FD9;&#x4E9B;&#x9500;&#x552E;&#x6570;&#x5B57;&#x662F;&#x6211;&#x4EEC;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E00;&#x5929;&#x7684;&#x9500;&#x552E;&#x989D;&#x4E3A;121&#x7F8E;&#x5143;&#xFF0C;&#x53E6;&#x4E00;&#x5929;&#x7684;&#x9500;&#x552E;&#x989D;&#x4E3A;207&#x7F8E;&#x5143;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7D2F;&#x79EF;&#x7684;&#x9500;&#x552E;&#x6570;&#x91CF;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x9500;&#x552E;&#x6570;&#x91CF;&#x662F;&#x6700;&#x4F4E;&#x7684;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7D2F;&#x79EF;&#x7684;&#x9500;&#x552E;&#x7F16;&#x53F7;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C06;&#x6709;&#x4E00;&#x4E2A;&#x6700;&#x9AD8;&#x7684;&#x9500;&#x552E;&#x7F16;&#x53F7;&#xFF0C;&#x800C;&#x5176;&#x4F59;&#x7684;&#x9500;&#x552E;&#x7F16;&#x53F7;&#x5219;&#x4ECB;&#x4E8E;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#xFF08;&#x81F3;&#x5C11;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x786E;&#x5207;&#x7684;&#x91CD;&#x590D;&#x7F16;&#x53F7;&#xFF09;&#x3002;&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x8FD9;&#x4E9B;&#x9500;&#x552E;&#x4EF7;&#x503C;&#x7684;&#x4F4E;&#xFF0C;&#x9AD8;&#x548C;&#x4E2D;&#x95F4;&#x503C;&#xFF1A;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x662F;&#x9500;&#x552E;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x662F;&#x9500;&#x552E;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x5206;&#x5E03;&#x5177;&#x6709;&#x6570;&#x91CF;&#x8F83;&#x591A;&#x7684;&#x533A;&#x57DF;&#x548C;&#x6570;&#x91CF;&#x7A00;&#x758F;&#x7684;&#x533A;&#x57DF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6570;&#x5B57;&#x4F3C;&#x4E4E;&#x5728;&#x5206;&#x5E03;&#x7684;&#x4E2D;&#x5FC3;&#x9644;&#x8FD1;&#x662F;&#x6709;&#x503E;&#x5411;&#x6027;&#x7684;&#x3002;</p>
<figure id="fig1.1.4.2.1"><img src="../images/chapter02-statistics.jpg" alt="distributions"><figcaption>image - distributions</figcaption></figure>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x662F;&#x9500;&#x552E;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x6216;&#x9500;&#x552E;&#x5206;&#x5E03;&#x7684;&#x81F3;&#x5C11;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x5206;&#x5E03;&#x5177;&#x6709;&#x6570;&#x91CF;&#x8F83;&#x591A;&#x7684;&#x533A;&#x57DF;&#x548C;&#x6570;&#x91CF;&#x7A00;&#x758F;&#x7684;&#x533A;&#x57DF;&#x3002; &#x53E6;&#x5916;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6570;&#x5B57;&#x4F3C;&#x4E4E;&#x5728;&#x5206;&#x5E03;&#x7684;&#x4E2D;&#x5FC3;&#x9644;&#x8FD1;&#x662F;&#x6709;&#x503E;&#x5411;&#x6027;&#x7684;&#x3002;</p>
<h2 id="&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;"><a name="&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;" class="plugin-anchor" href="#&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;</h2>
<p>&#x4E3A;&#x4E86;&#x91CF;&#x5316;&#x5206;&#x5E03;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x4E9B;&#x91CF;&#x5EA6;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;</p>
<blockquote>
<p>1.&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x5EA6;&#x91CF;&#xFF1A;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x8861;&#x91CF;&#x5927;&#x591A;&#x6570;&#x503C;&#x7684;&#x4F4D;&#x7F6E;&#x6216;&#x5206;&#x5E03;&#x4E2D;&#x5FC3;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6CBF;&#x7740;&#x524D;&#x9762;&#x7684;&#x7EBF;&#x6027;&#x8868;&#x793A;&#xFF09;&#x3002;</p>
<p>2.&#x6563;&#x5E03;&#x6216;&#x6563;&#x5E03;&#x5EA6;&#x91CF;&#xFF1A;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x7528;&#x4E8E;&#x8861;&#x91CF;&#x5206;&#x5E03;&#x7684;&#x503C;&#x5982;&#x4F55;&#x5206;&#x5E03;&#x5728;&#x5206;&#x5E03;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF08;&#x4ECE;&#x6700;&#x4F4E;&#x503C;&#x5230;&#x6700;&#x9AD8;&#x503C;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x6709;&#x591A;&#x79CD;&#x8F6F;&#x4EF6;&#x5305;&#x53EF;&#x8BA9;&#x60A8;&#x5FEB;&#x901F;&#x8BA1;&#x7B97;&#x548C;/&#x6216;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x7EDF;&#x8BA1;&#x91CF;&#x5EA6;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;gonum.org/v1/gonum/stat&#xFF08;&#x60A8;&#x53EF;&#x80FD;&#x5F00;&#x59CB;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x5C06;&#x5927;&#x91CF;&#x4F7F;&#x7528;gonum&#xFF09;&#x548C;github.com/montanaflynn/stats&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;thegonum.org / v1 / gonum / statandgithub.com / montanaflynn / statspackages&#x7684;&#x540D;&#x79F0;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x5DEE;&#x5F02;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x5404;&#x8282;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<h3 id="&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x7684;&#x91CF;&#x5EA6;"><a name="&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x7684;&#x91CF;&#x5EA6;" class="plugin-anchor" href="#&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x7684;&#x91CF;&#x5EA6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x7684;&#x91CF;&#x5EA6;</h3>
<p>&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x7684;&#x5EA6;&#x91CF;&#x5305;&#x62EC;&#xFF1A;</p>
<blockquote>
<p>Mean: &#x8FD9;&#x5C31;&#x662F;&#x60A8;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002; &#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5BF9;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x5B57;&#x6C42;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x9664;&#x4EE5;&#x6570;&#x5B57;&#x6570;&#x6765;&#x8BA1;&#x7B97;&#x3002;
Median: &#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x5B57;&#x4ECE;&#x6700;&#x4F4E;&#x5230;&#x6700;&#x9AD8;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5219;&#x8BE5;&#x6570;&#x5B57;&#x5C06;&#x6570;&#x5B57;&#x7684;&#x6700;&#x4F4E;&#x4E00;&#x534A;&#x4E0E;&#x6570;&#x5B57;&#x7684;&#x6700;&#x9AD8;&#x4E00;&#x534A;&#x5206;&#x9694;&#x5F00;&#x3002;
Mode: &#x8FD9;&#x662F;&#x5206;&#x5E03;&#x4E2D;&#x6700;&#x9891;&#x7E41;&#x51FA;&#x73B0;&#x7684;&#x503C;&#x3002;</p>
</blockquote>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x7B2C;1&#x7AE0;&#x201C;&#x6536;&#x96C6;&#x548C;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x201D;&#x4E2D;&#x5148;&#x524D;&#x4ECB;&#x7ECD;&#x7684;&#x8679;&#x819C;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4E00;&#x5217;&#x4E2D;&#x7684;&#x503C;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x3002; &#x63D0;&#x9192;&#x4E00;&#x4E0B;&#xFF0C;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x5305;&#x62EC;&#x56DB;&#x5217;&#x82B1;&#x6735;&#x6D4B;&#x91CF;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x5217;&#x76F8;&#x5E94;&#x7684;&#x82B1;&#x5349;&#x79CD;&#x7C7B;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x5EA6;&#x91CF;&#x503C;&#x5217;&#x90FD;&#x5305;&#x542B;&#x4EE3;&#x8868;&#x8BE5;&#x5EA6;&#x91CF;&#x503C;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x7EC4;&#x503C;&#xFF1A;</p>
<pre class="language-"><code>// Open the CSV file.
irisFile, err := os.Open(&quot;../data/iris.csv&quot;)
if err != nil {
    log.Fatal(err)
}
defer irisFile.Close()

// Create a dataframe from the CSV file.
irisDF := dataframe.ReadCSV(irisFile)

// Get the float values from the &quot;sepal_length&quot; column as
// we will be looking at the measures for this variable.
sepalLength := irisDF.Col(&quot;sepal_length&quot;).Float()

// Calculate the Mean of the variable.
meanVal := stat.Mean(sepalLength, nil)

// Calculate the Mode of the variable.
modeVal, modeCount := stat.Mode(sepalLength, nil)

// Calculate the Median of the variable.
medianVal, err := stats.Median(sepalLength)
if err != nil {
    log.Fatal(err)
}

// Output the results to standard out.
fmt.Printf(&quot;\nSepal Length Summary Statistics:\n&quot;)
fmt.Printf(&quot;Mean value: %0.2f\n&quot;, meanVal)
fmt.Printf(&quot;Mode value: %0.2f\n&quot;, modeVal)
fmt.Printf(&quot;Mode count: %d\n&quot;, int(modeCount))
fmt.Printf(&quot;Median value: %0.2f\n\n&quot;, medianVal)
</code></pre><p>&#x8FD0;&#x884C;&#x6B64;&#x7A0B;&#x5E8F;&#x5C06;&#x5BFC;&#x81F4;&#x4EE5;&#x4E0B;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre class="language-"><code>$ go build
$ ./myprogram

Sepal Length Summary Statistics:
Mean value: 5.84
Mode value: 5.00
Mode count: 10
Median value: 5.80
</code></pre><p>&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5747;&#x503C;&#xFF0C;&#x4F17;&#x6570;&#x548C;&#x4E2D;&#x4F4D;&#x6570;&#x7565;&#x6709;&#x4E0D;&#x540C;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;sepal_length&#x5217;&#x4E2D;&#x7684;&#x503C;&#x7684;&#x5E73;&#x5747;&#x503C;&#x548C;&#x4E2D;&#x4F4D;&#x6570;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x5C06;sepal_length&#x66F4;&#x6539;&#x4E3A;&#x82B1;&#x74E3;&#x957F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#x4EE5;&#x4E0B;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre class="language-"><code>$ go build
$ ./myprogram

Sepal Length Summary Statistics:
Mean value: 3.76
Mode value: 1.50
Mode count: 14
Median value: 4.35
</code></pre><p>&#x5BF9;&#x4E8E;petal_length&#x503C;&#xFF0C;&#x5E73;&#x5747;&#x503C;&#x548C;&#x4E2D;&#x4F4D;&#x6570;&#x4E0D;&#x592A;&#x63A5;&#x8FD1;&#x3002; &#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x4ECE;&#x8BE5;&#x4FE1;&#x606F;&#x4E2D;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x6570;&#x636E;&#x7684;&#x76F4;&#x89C9;&#x3002; &#x5982;&#x679C;&#x5E73;&#x5747;&#x503C;&#x548C;&#x4E2D;&#x4F4D;&#x6570;&#x4E0D;&#x63A5;&#x8FD1;&#xFF0C;&#x5219;&#x610F;&#x5473;&#x7740;&#x8F83;&#x9AD8;&#x6216;&#x8F83;&#x4F4E;&#x7684;&#x503C;&#x5206;&#x522B;&#x62D6;&#x7D2F;&#x4E86;&#x5E73;&#x5747;&#x503C;&#x7684;&#x8F83;&#x9AD8;&#x6216;&#x8F83;&#x4F4E;-&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x5728;&#x4E2D;&#x4F4D;&#x6570;&#x4E2D;&#x4E0D;&#x90A3;&#x4E48;&#x660E;&#x663E;&#x3002; &#x6211;&#x4EEC;&#x79F0;&#x5176;&#x4E3A;&#x504F;&#x6001;&#x5206;&#x5E03;&#x3002;</p>
<h3 id="&#x6269;&#x6563;&#x6216;&#x5206;&#x6563;&#x63AA;&#x65BD;"><a name="&#x6269;&#x6563;&#x6216;&#x5206;&#x6563;&#x63AA;&#x65BD;" class="plugin-anchor" href="#&#x6269;&#x6563;&#x6216;&#x5206;&#x6563;&#x63AA;&#x65BD;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6269;&#x6563;&#x6216;&#x5206;&#x6563;&#x63AA;&#x65BD;</h3>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x503C;&#x4F4D;&#x4E8E;&#x4F55;&#x5904;&#xFF08;&#x6216;&#x5206;&#x5E03;&#x7684;&#x4E2D;&#x5FC3;&#xFF09;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x91CF;&#x5316;&#x5206;&#x5E03;&#x7684;&#x503C;&#x5982;&#x4F55;&#x5206;&#x5E03;&#x5728;&#x5206;&#x5E03;&#x4E2D;&#x5FC3;&#x9644;&#x8FD1;&#x3002; &#x91CF;&#x5316;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x4E00;&#x4E9B;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x63AA;&#x65BD;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>Maximum: &#x6700;&#x9AD8;&#x5206;&#x5E03;&#x503C;
Minimum: &#x6700;&#x4F4E;&#x5206;&#x5E03;&#x503C;
Range: &#x6700;&#x5927;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;
Variance: &#x901A;&#x8FC7;&#x83B7;&#x53D6;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x503C;&#xFF0C;&#x4ECE;&#x5206;&#x5E03;&#x7684;&#x5747;&#x503C;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5BF9;&#x8BE5;&#x5DEE;&#x5F02;&#x8FDB;&#x884C;&#x5E73;&#x65B9;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x5176;&#x4ED6;&#x5E73;&#x65B9;&#x5DEE;&#x76F8;&#x52A0;&#x5E76;&#x9664;&#x4EE5;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x503C;&#x6570;&#x91CF;&#x6765;&#x8BA1;&#x7B97;&#x6B64;&#x5EA6;&#x91CF;
Standard deviation: &#x65B9;&#x5DEE;&#x7684;&#x5E73;&#x65B9;&#x6839;
Quantiles/quartiles: &#x4E0E;&#x4E2D;&#x4F4D;&#x6570;&#x76F8;&#x4F3C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x5B9A;&#x4E49;&#x4E86;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x4E34;&#x754C;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8F83;&#x4F4E;&#x503C;&#x4F4E;&#x4E8E;&#x8BE5;&#x5EA6;&#x91CF;&#xFF0C;&#x800C;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x8F83;&#x9AD8;&#x7684;&#x503C;&#x9AD8;&#x4E8E;&#x8BE5;&#x5EA6;&#x91CF;</p>
</blockquote>
<p>&#x4F7F;&#x7528;gonum.org/v1/gonum/stat&#xFF0C;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre class="language-"><code>// Open the CSV file.
irisFile, err := os.Open(&quot;../data/iris.csv&quot;)
if err != nil {
    log.Fatal(err)
}
defer irisFile.Close()

// Create a dataframe from the CSV file.
irisDF := dataframe.ReadCSV(irisFile)

// Get the float values from the &quot;sepal_length&quot; column as
// we will be looking at the measures for this variable.
sepalLength := irisDF.Col(&quot;petal_length&quot;).Float()

// Calculate the Max of the variable.
minVal := floats.Min(sepalLength)

// Calculate the Max of the variable.
maxVal := floats.Max(sepalLength)

// Calculate the Median of the variable.
rangeVal := maxVal - minVal

// Calculate the variance of the variable.
varianceVal := stat.Variance(sepalLength, nil)

// Calculate the standard deviation of the variable.
stdDevVal := stat.StdDev(sepalLength, nil)

// Sort the values.
inds := make([]int, len(sepalLength))
floats.Argsort(sepalLength, inds)

// Get the Quantiles.
quant25 := stat.Quantile(0.25, stat.Empirical, sepalLength, nil)
quant50 := stat.Quantile(0.50, stat.Empirical, sepalLength, nil)
quant75 := stat.Quantile(0.75, stat.Empirical, sepalLength, nil)

// Output the results to standard out.
fmt.Printf(&quot;\nSepal Length Summary Statistics:\n&quot;)
fmt.Printf(&quot;Max value: %0.2f\n&quot;, maxVal)
fmt.Printf(&quot;Min value: %0.2f\n&quot;, minVal)
fmt.Printf(&quot;Range value: %0.2f\n&quot;, rangeVal)
fmt.Printf(&quot;Variance value: %0.2f\n&quot;, varianceVal)
fmt.Printf(&quot;Std Dev value: %0.2f\n&quot;, stdDevVal)
fmt.Printf(&quot;25 Quantile: %0.2f\n&quot;, quant25)
fmt.Printf(&quot;50 Quantile: %0.2f\n&quot;, quant50)
fmt.Printf(&quot;75 Quantile: %0.2f\n\n&quot;, quant75)
</code></pre><p>&#x8FD0;&#x884C;&#x6B64;&#x7A0B;&#x5E8F;&#x5C06;&#x5F97;&#x5230;&#x4EE5;&#x4E0B;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre class="language-"><code>$ go build
$ ./myprogram

Sepal Length Summary Statistics:
Max value: 6.90
Min value: 1.00
Range value: 5.90
Variance value: 3.11
Std Dev value: 1.76
25 Quantile: 1.60
50 Quantile: 4.30
75 Quantile: 5.10
</code></pre><p>&#x597D;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#xFF0C;&#x770B;&#x770B;&#x5B83;&#x4EEC;&#x5BF9;sepal_length&#x5217;&#x4E2D;&#x503C;&#x5206;&#x5E03;&#x7684;&#x542B;&#x4E49;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4EE5;&#x4E0B;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6807;&#x51C6;&#x504F;&#x5DEE;&#x4E3A;1.76&#xFF0C;&#x6574;&#x4E2A;&#x503C;&#x8303;&#x56F4;&#x4E3A;5.90&#x3002; &#x4E0E;&#x65B9;&#x5DEE;&#x76F8;&#x53CD;&#xFF0C;&#x6807;&#x51C6;&#x504F;&#x5DEE;&#x4E0E;&#x503C;&#x672C;&#x8EAB;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x503C;&#x8303;&#x56F4;&#x5185;&#x53D8;&#x5316;&#x5F88;&#x5927;&#xFF08;&#x6807;&#x51C6;&#x504F;&#x5DEE;&#x503C;&#x7EA6;&#x4E3A;&#x503C;&#x603B;&#x8303;&#x56F4;&#x7684;30&#xFF05;&#xFF09; &#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x5206;&#x4F4D;&#x6570;&#x3002; 25&#xFF05;&#x7684;&#x5206;&#x4F4D;&#x6570;&#x4EE3;&#x8868;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;&#x5206;&#x5E03;&#x4E2D;&#x7684;25&#xFF05;&#x7684;&#x503C;&#x4F4E;&#x4E8E;&#x5EA6;&#x91CF;&#x503C;&#xFF0C;&#x800C;&#x5176;&#x4ED6;75&#xFF05;&#x7684;&#x503C;&#x9AD8;&#x4E8E;&#x5EA6;&#x91CF;&#x503C;&#x3002; &#x5BF9;&#x4E8E;50&#xFF05;&#x548C;75&#xFF05;&#x7684;&#x5206;&#x4F4D;&#x6570;&#xFF0C;&#x8FD9;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#x3002; &#x7531;&#x4E8E;25&#xFF05;&#x7684;&#x5206;&#x4F4D;&#x6570;&#x6BD4;75&#xFF05;&#x7684;&#x5206;&#x4F4D;&#x6570;&#x4E0E;&#x6700;&#x5927;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x66F4;&#x63A5;&#x8FD1;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63A8;&#x65AD;&#x51FA;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x8F83;&#x9AD8;&#x503C;&#x6BD4;&#x8F83;&#x4F4E;&#x503C;&#x66F4;&#x5BB9;&#x6613;&#x6563;&#x5F00;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x5EA6;&#x91CF;&#x4E0E;&#x96C6;&#x4E2D;&#x8D8B;&#x52BF;&#x5EA6;&#x91CF;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x91CF;&#x5316;&#x5206;&#x5E03;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x6DB5;&#x76D6;&#x5176;&#x4ED6;&#x7EDF;&#x8BA1;&#x5EA6;&#x91CF;&#x3002;</p>
<p>Tips: &#x8FD9;&#x91CC;&#x7684;&#x8981;&#x70B9;&#x662F;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x63AA;&#x65BD;&#x6765;&#x5E2E;&#x52A9;&#x60A8;&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x578B;&#x3002; &#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x6839;&#x636E;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x7406;&#x667A;&#x6765;&#x68C0;&#x67E5;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x53EF;&#x89C6;&#x5316;&#x5206;&#x5E03;"><a name="&#x53EF;&#x89C6;&#x5316;&#x5206;&#x5E03;" class="plugin-anchor" href="#&#x53EF;&#x89C6;&#x5316;&#x5206;&#x5E03;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x53EF;&#x89C6;&#x5316;&#x5206;&#x5E03;</h2>
<p>&#x5C3D;&#x7BA1;&#x91CF;&#x5316;&#x5206;&#x914D;&#x7684;&#x5916;&#x89C2;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x53EF;&#x89C6;&#x5316;&#x5206;&#x914D;&#x4EE5;&#x83B7;&#x53D6;&#x6700;&#x5927;&#x7684;&#x76F4;&#x89C9;&#x3002; &#x6709;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x56FE;&#x548C;&#x56FE;&#x5F62;&#x53EF;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x503C;&#x5206;&#x5E03;&#x7684;&#x53EF;&#x89C6;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x5F62;&#x6210;&#x6570;&#x636E;&#x7684;&#x5FC3;&#x7406;&#x6A21;&#x578B;&#x5E76;&#x5C06;&#x6709;&#x5173;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x8FBE;&#x7ED9;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x7684;&#x5176;&#x4ED6;&#x6210;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7528;&#x6237;&#x7B49; &#x4E0A;&#x3002;</p>
<h3 id="&#x76F4;&#x65B9;&#x56FE;-histograms"><a name="&#x76F4;&#x65B9;&#x56FE;-histograms" class="plugin-anchor" href="#&#x76F4;&#x65B9;&#x56FE;-histograms"><i class="fa fa-link" aria-hidden="true"></i></a>&#x76F4;&#x65B9;&#x56FE; Histograms</h3>
<p>&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x5206;&#x5E03;&#x7684;&#x56FE;&#x5F62;&#x6216;&#x56FE;&#x8868;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x76F4;&#x65B9;&#x56FE;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x76F4;&#x65B9;&#x56FE;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7EC4;&#x7EC7;&#x6216;&#x8BA1;&#x7B97;&#x503C;&#x7684;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x7ED8;&#x5236;&#x5728;&#x76F4;&#x65B9;&#x56FE;&#x4E2D;&#x3002; &#x4E3A;&#x4E86;&#x5F62;&#x6210;&#x76F4;&#x65B9;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;bin&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x503C;&#x7684;&#x603B;&#x8303;&#x56F4;&#x5185;&#x5207;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x524D;&#x9762;&#x51E0;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x9500;&#x552E;&#x6570;&#x91CF;&#x5206;&#x5E03;&#x4E3A;&#x4F8B;&#xFF1A;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5206;&#x7C7B;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x503C;&#xFF1A;&#x8FD9;&#x4E9B;&#x8BA1;&#x6570;&#x4E0E;&#x5206;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x4E00;&#x8D77;&#x6784;&#x6210;&#x76F4;&#x65B9;&#x56FE;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x8BA1;&#x6570;&#x56FE;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x76F4;&#x89C2;&#x663E;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x5E03;&#xFF1A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;gonum&#x4ECE;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x76F4;&#x65B9;&#x56FE;&#x5E76;&#x7ED8;&#x5236;&#x76F4;&#x65B9;&#x56FE;&#x3002; &#x53EF;&#x4EE5;&#x5728;gonum.org/v1/plot&#x4E2D;&#x627E;&#x5230;gonum&#x63D0;&#x4F9B;&#x7684;&#x7528;&#x4E8E;&#x6B64;&#x7C7B;&#x7ED8;&#x56FE;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x7ED8;&#x56FE;&#x3002; &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;</p>
<figure id="fig1.1.4.2.2"><img src="../images/chapter02-histograms.jpg" alt="1"><figcaption>image - 1</figcaption></figure>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x4EE5;&#x4E0B;&#x6BCF;&#x4E2A;&#x7BB1;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x503C;&#xFF1A;</p>
<figure id="fig1.1.4.2.3"><img src="../images/chapter02-histograms2.jpg" alt="2"><figcaption>image - 2</figcaption></figure>
<p>&#x8FD9;&#x4E9B;&#x8BA1;&#x6570;&#x4E0E;&#x5783;&#x573E;&#x7BB1;&#x7684;&#x5B9A;&#x4E49;&#x4E00;&#x8D77;&#x6784;&#x6210;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x65B9;&#x56FE;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x8BA1;&#x6570;&#x56FE;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x76F4;&#x89C2;&#x663E;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x5E03;&#xFF1A;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;gonum&#x4ECE;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x76F4;&#x65B9;&#x56FE;&#x5E76;&#x7ED8;&#x5236;&#x76F4;&#x65B9;&#x56FE;&#x3002; &#x53EF;&#x4EE5;&#x5728;gonum.org/v1/plot&#x4E2D;&#x627E;&#x5230;gonum&#x63D0;&#x4F9B;&#x7684;&#x7528;&#x4E8E;&#x6B64;&#x7C7B;&#x7ED8;&#x56FE;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x7ED8;&#x56FE;&#x3002; &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x8679;&#x819C;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x6BCF;&#x4E2A;&#x5217;&#x7684;&#x76F4;&#x65B9;&#x56FE;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4ECE;gonum&#x5BFC;&#x5165;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre class="language-"><code>import (
    &quot;gonum.org/v1/plot&quot;
    &quot;gonum.org/v1/plot/plotter&quot;
    &quot;gonum.org/v1/plot/vg&quot;
)
</code></pre><p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BFB;&#x53D6;&#x8679;&#x819C;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6846;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x751F;&#x6210;&#x76F4;&#x65B9;&#x56FE;&#x7684;&#x6570;&#x503C;&#x5217;&#xFF1A;</p>
<pre class="language-"><code>// Open the CSV file.
irisFile, err := os.Open(&quot;../data/iris.csv&quot;)
if err != nil {
    log.Fatal(err)
}
defer irisFile.Close()

// Create a dataframe from the CSV file.
irisDF := dataframe.ReadCSV(irisFile)

// Create a histogram for each of the feature columns in the dataset.
for _, colName := range irisDF.Names() {

    // If the column is one of the feature columns, let&apos;s create
    // a histogram of the values.
    if colName != &quot;species&quot; {

        // Create a plotter.Values value and fill it with the
        // values from the respective column of the dataframe.
        v := make(plotter.Values, irisDF.Nrow())
        for i, floatVal := range irisDF.Col(colName).Float() {
            v[i] = floatVal
    }

        // Make a plot and set its title.
        p, err := plot.New()
        if err != nil {
            log.Fatal(err)
        }
        p.Title.Text = fmt.Sprintf(&quot;Histogram of a %s&quot;, colName)


        // Create a histogram of our values drawn
        // from the standard normal.
        h, err := plotter.NewHist(v, 16)
        if err != nil {
            log.Fatal(err)
        }

        // Normalize the histogram.
        h.Normalize(1)

        // Add the histogram to the plot.
        p.Add(h)

        // Save the plot to a PNG file.
        if err := p.Save(4*vg.Inch, 4*vg.Inch, colName+&quot;_hist.png&quot;); err != nil {
            log.Fatal(err)
        }
    }
}
</code></pre><p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6807;&#x51C6;&#x5316;&#x4E86;&#x76F4;&#x65B9;&#x56FE;&#xFF08;&#x4F7F;&#x7528;h.Normalize&#xFF08;&#xFF09;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x5178;&#x578B;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x8BA1;&#x6570;&#x503C;&#x7684;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#x3002; &#x76F4;&#x65B9;&#x56FE;&#x5F52;&#x4E00;&#x5316;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5E76;&#x6392;&#x6BD4;&#x8F83;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E03;</p>
<p>&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x4E3A;&#x8679;&#x819C;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x5217;&#x751F;&#x6210;&#x56DB;&#x4E2A;&#x5E26;&#x6709;&#x4EE5;&#x4E0B;&#x76F4;&#x65B9;&#x56FE;&#x7684;* .png&#x6587;&#x4EF6;&#xFF1A;</p>
<figure id="fig1.1.4.2.4"><img src="../images/chapter02-histograms4.jpg" alt="4"><figcaption>image - 4</figcaption></figure>
<p>&#x8FD9;&#x4E9B;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x4E0E;&#x5176;&#x4ED6;&#x5206;&#x5E03;&#x4E0D;&#x540C;&#x3002; sepal_width&#x5206;&#x5E03;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x949F;&#x5F62;&#x66F2;&#x7EBF;&#x6216;&#x6B63;&#x6001;/&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x540E;&#x9762;&#x8BA8;&#x8BBA;&#xFF09;&#x3002; &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x82B1;&#x74E3;&#x5206;&#x5E03;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E0D;&#x540C;&#x503C;&#x7C07;&#x3002; &#x5728;&#x4EE5;&#x540E;&#x5F00;&#x53D1;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x6D41;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#xFF0C;&#x4EC5;
&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x4E9B;&#x53EF;&#x89C6;&#x5316;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x7684;&#x5FC3;&#x7406;&#x6A21;&#x578B;&#x3002;</p>
<h3 id="&#x7BB1;&#x5F62;&#x56FE;"><a name="&#x7BB1;&#x5F62;&#x56FE;" class="plugin-anchor" href="#&#x7BB1;&#x5F62;&#x56FE;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7BB1;&#x5F62;&#x56FE;</h3>
<p>&#x76F4;&#x65B9;&#x56FE;&#x7EDD;&#x4E0D;&#x662F;&#x4ECE;&#x89C6;&#x89C9;&#x4E0A;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x3002; &#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x7ED8;&#x56FE;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x7BB1;&#x5F62;&#x7ED8;&#x56FE;&#x3002; &#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x56FE;&#x8FD8;&#x4F7F;&#x6211;&#x4EEC;&#x5BF9;&#x5206;&#x5E03;&#x4E2D;&#x7684;&#x503C;&#x7684;&#x5206;&#x7EC4;&#x548C;&#x6563;&#x5E03;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E0E;&#x76F4;&#x65B9;&#x56FE;&#x76F8;&#x53CD;&#xFF0C;&#x7BB1;&#x5F62;&#x56FE;&#x5177;&#x6709;&#x51E0;&#x4E2A;&#x53EF;&#x5E2E;&#x52A9;&#x5F15;&#x5BFC;&#x773C;&#x775B;&#x7684;&#x660E;&#x663E;&#x7279;&#x5F81;&#xFF1A;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> Copyright &#xA9; 2015-present airdb. </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> LastUpdated:  2020-01-14 16:07:48 </span> </footer>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="matrices-and-vectors.html" class="navigation navigation-prev " aria-label="Previous page: 矩阵和向量">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../" class="navigation navigation-next " aria-label="Next page: Chapter 03 - 评估与验证">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"统计","level":"1.1.4.2","depth":3,"next":{"title":"Chapter 03 - 评估与验证","level":"1.1.5","depth":2,"path":"wiki/machine-learning-with-go/README.md","ref":"wiki/machine-learning-with-go/README.md","articles":[]},"previous":{"title":"矩阵和向量","level":"1.1.4.1","depth":3,"path":"wiki/machine-learning-with-go/chapter02/matrices-and-vectors.md","ref":"wiki/machine-learning-with-go/chapter02/matrices-and-vectors.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters","toggle-chapters","mathjax","anchors","disqus","github","editlink","custom-favicon","prism","-highlight","-lunr","-search","search-plus","codesnippet","splitter","page-toc-button","image-captions","page-footer-ex","tags","multipart"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"disqus":{"useIdentifier":false,"shortName":"airdb"},"github":{"url":"https://github.com/airdb/gitbook"},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/airdb/gitbook/blob/master/"},"page-footer-ex":{"copyright":"Copyright © 2015-present airdb.","markdown":false,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"LastUpdated: "},"splitter":{},"multipart":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":"favicon.ico","page-toc-button":{"maxTocDepth":2,"minTocSize":2},"custom-favicon":{},"tags":{"placement":"bottom"},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":true,"weibo":true,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{},"toggle-chapters":{},"expandable-chapters":{},"search-plus":{},"image-captions":{"caption":"image - _CAPTION_","variable_name":"_pictures"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":11,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56},"toc":true},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"wiki/machine-learning-with-go/chapter02/statistics.html#fig1.1.4.2.1","level":"1.1.4.2","list_caption":"Figure: distributions","alt":"distributions","nro":1,"url":"../images/chapter02-statistics.jpg","index":1,"caption_template":"image - _CAPTION_","label":"distributions","attributes":{},"skip":false,"key":"1.1.4.2.1"},{"backlink":"wiki/machine-learning-with-go/chapter02/statistics.html#fig1.1.4.2.2","level":"1.1.4.2","list_caption":"Figure: 1","alt":"1","nro":2,"url":"../images/chapter02-histograms.jpg","index":2,"caption_template":"image - _CAPTION_","label":"1","attributes":{},"skip":false,"key":"1.1.4.2.2"},{"backlink":"wiki/machine-learning-with-go/chapter02/statistics.html#fig1.1.4.2.3","level":"1.1.4.2","list_caption":"Figure: 2","alt":"2","nro":3,"url":"../images/chapter02-histograms2.jpg","index":3,"caption_template":"image - _CAPTION_","label":"2","attributes":{},"skip":false,"key":"1.1.4.2.3"},{"backlink":"wiki/machine-learning-with-go/chapter02/statistics.html#fig1.1.4.2.4","level":"1.1.4.2","list_caption":"Figure: 4","alt":"4","nro":4,"url":"../images/chapter02-histograms4.jpg","index":4,"caption_template":"image - _CAPTION_","label":"4","attributes":{},"skip":false,"key":"1.1.4.2.4"}]},"title":"airdb","language":"en-us","links":{"sidebar":{"Home":"https://airdb.wiki"}},"gitbook":"*","description":"gitbook"},"file":{"path":"wiki/machine-learning-with-go/chapter02/statistics.md","mtime":"2020-01-14T16:07:48.941Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-14T16:09:11.401Z"},"basePath":"../../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-toggle-chapters/toggle.js"></script>
        
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

